{ 
    "Referral letter (record artifact)": { 
        "name": "Referral letter", 
        "result": "Thank you for seeing this patient whom I organised an urgent chest X-ray for after an episode of haemoptysis. They had a dry cough lasting a few weeks and did cough up some fresh blood. There X-ray has shown a new spiculated bulkiness on the right hilar upper pole suggestive of a new primary tumour. I understand the radiology department are organising an urgent CT. The patient had a history of distal bowel cancer, diagnosed at late stage in 2016. They underwent a Hartmann's procedure and they now have a stoma. They have done well from recovering from their cancer and has been stable for the past 4 years. The patient also has hypertension and type 2 diabetes. I enclose a copy of their current medication and they are allergic to penicillin and simvastatin. \nThe patient does have the capacity to make her own decisions but her sister has power of attorney for health for medical grounds and I expect will attend any appointments with her. \nThank you for your help. " 
    }, 
    "Plain chest X-ray (procedure)": { 
        "name": "Chest X-ray", 
        "result": "A new, spiculated bulkiness enveloping the right hilar upper pole is suggestive of a new primary tumour rather than metastatic disease. There is some thickening atelectasis at the left base / epicardiac fat pad which is less concerning. Needs prompt CT correlation. The radiology department will arrange this. Please inform the patient and institute fast track 2WW referral." 
    },  
    "Computed tomography of chest (procedure)": { 
        "name": "CT chest", 
        "result": "1. Large spiculated malignant mass narrowing but not occluding the right upper lobe bronchus. Medially it is invading the mediastinum and extending into the posterior segment of the right upper lobe, but is both engulfing some associated right hilar adenopathy and also breaching the major fissure, extending into the apical segment of the right lower lobe. Axial dimensions approximately 90 x 60 mm. \nSimilar but smaller 27 mm mass medially in the left lower lobe, possibly synchronous primary tumour rather than metastases, although several bilateral pulmonary nodules do suggest haematogenous pulmonary metastases, generally subcentimetre, 6-12 in total. There is some inflammatory nodularity at the lateral margins of the tumour, but no evidence of malignant effusion or lymphangitis. \n2. Adjacent malignant mediastinal lymph nodes, 16 mm in the right paratracheal and precarinal stations, 13 mm at the subcarinal station. Small volume retroperitoneal adenopathy is unchanged from previously. \n3. No convincing liver, adrenal destructive bony metastases are detected. Likely mild healing compression fracture at the T11 superior endplate. Midline hernia has developed, containing mostly omental fat. No ascites. \nSummary \nAggressive, invasive new right upper lobe primary tumour, provisional staging T4 N2 M1a. The pulmonary metastases may of course relate to the underlying gastrointestinal malignancy, impossible to determine on CT." 
    }, 
    "Positron emission tomography with computed tomography (procedure)": { 
        "name": "PET-CT", 
        "result": "PET-CT shows a large 92 x 63 mm, high uptake (SUV 15.2) mass in the right upper lobe with involvement of the right bronchus, mediastinum and major fissure, extending into the right lower lobe. Several small areas of high update (SUV 5.6-12.5) are likely metastatic spread. There is no uptake from the previous bowel surgical site and the stoma looks patent." 
    }, 
    "Computed tomography of head with contrast (procedure)": { 
        "name": "CT head - contrast", 
        "result": "No intracranial changes seen" 
    }, 
    "Magnetic resonance imaging of head (procedure)": { 
        "name": "MRI head", 
        "result": "No intracranial changes seen" 
    }, 
    "Measurement of respiratory function (procedure)": { 
        "name": "Lung function tests", 
        "result": "Mild restrictive picture and reduced gas transfer. FEV1 1.47 (76% predicted), FVC 1.77 (81% predicted), FEV1/FVC ratio of 79, TCLO 6.12 (86% predicted) and KCO of 1.24 (80% predicted)" 
    }, 
    "Echocardiography (procedure)": { 
        "name": "ECHO", 
        "result": "Normal left ventricular cavity size and good systolic function. Visual ejection fracture = 55-65%. Normal right ventricular size and systolic function. Moderately dilated left atrium."
    }, 
    "Biopsy of thorax using computed tomography guidance (procedure)": { 
        "name": "CT guided biopsy thorax", 
        "result": "CT guided biopsy was cancelled after discussion with cancer lead. This patient is most likely for best supportive care and a biopsy would hence not be required." 
    }, 
    "Pathology report (record artifact)": { 
        "name": "Pathology", 
        "result": "NA" 
    }, 
    "Transbronchial needle aspiration using endobronchial ultrasonography guidance (procedure)": { 
        "name": "EBUS", 
        "result": "EBUS was cancelled after discussion with cancer lead. This patient is most likely for best supportive care and a biopsy would hence not be required." 
    }, 
    "Electrocardiogram analysis (qualifier value)": { 
        "name": "ECG", 
        "result": "Normal sinus rhythm." 
    }, 
    "Prehabilitation (regime/therapy)": { 
        "name": "Prehad referral", 
        "result": "Many thanks for referring this patient to physiotherapy for prehab. We have now accessed the patient and have given them an exercise routine to help build up their muscle strength. " 
    }, 
    "Patient referral to dietitian (procedure)": { 
        "name": "Dietician referral", 
        "result": "Many thanks for referring this patient to us for a dietetic assessment. We have now assessed the patient and have provided them with some high energy drinks." 
    }, 
    "Thoracoscopy (procedure)": { 
        "name": "Thoracoscopy", 
        "result": "Thoracoscopy was cancelled after discussion with cancer lead. This patient is most likely for best supportive care and a biopsy would hence not be required." 
    }, 
    "Bronchoscopy (procedure)": { 
        "name": "Bronchoscopy", 
        "result": "Bronchoscopy was cancelled after discussion with cancer lead. This patient is most likely for best supportive care and a biopsy would hence not be required." 
    },
    "Thoracentesis (procedure)": { 
        "name": "Pleural tap", 
        "result": "The pleural tap was cancelled as no fluid was seen on the recent Chest X-ray" 
    }, 
    "Cardiopulmonary exercise test (procedure)": { 
        "name": "CPET", 
        "result": "CPET was cancelled after discussion with cancer lead. This patient is most likely for best supportive care and a biopsy would hence not be required." 
    }, 
    "Referral to smoking cessation service (procedure)": { 
        "name": "Smoking cessation referral", 
        "result": "Many thanks for your referral for smoking cessation. On calling the patient there was no smoking history. Hence we will not be following her up." 
    }, 
    "Blood test (procedure)": { 
        "name": "Bloods", 
        "result": "Full blood count, urea & electrolytes and liver function tests were normal." 
    }, 
    "Assessment by multidisciplinary team (procedure)": { 
        "name": "Add to MDT", 
        "result": "MDT recommends for best supportive care." 
    }, 
    "Appointment (record artifact)": { 
        "name": "Book clinic appointment", 
        "result": "Patient is now with you in clinic." 
    },
    "Clinical history": { 
        "name": "Clinical history", 
        "result": " Proximal large lung cancer. Likely palliative." 
    },
    "Comorbidities": { 
        "name": "Comorbidities", 
        "result": "Hartmann's procedure for lower bowel cancer. Hypertension and type 2 diabetes." 
    }
} 